In [1]:
import pandas as pd

In [2]:
import numpy as np

In [6]:
df = pd.DataFrame(
    {
        "Name":[
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age" : [22,35,55],
        "Sex" : ["female","male","female"],

    }
)

In [7]:
df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22  female
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   55  female

In [8]:
df["Age"]

0    22
1    35
2    55
Name: Age, dtype: int64

In [9]:
ages = pd.Series([22,35,58],name="Age")

In [10]:
ages

0    22
1    35
2    58
Name: Age, dtype: int64

In [12]:
df["Age"].max()

55

In [13]:
ages.max()

58

In [14]:
df.describe()

             Age
count   3.000000
mean   37.333333
std    16.623277
min    22.000000
25%    28.500000
50%    35.000000
75%    45.000000
max    55.000000